input:"pool2_2"
input_dim:1
input_dim:50
input_dim:4
input_dim:4
layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "pool2_2"
  top: "fc1_2"
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
  }
}