input:"relu2_1"
input_dim:1
input_dim:50
input_dim:8
input_dim:8

input:"relu2_2"
input_dim:1
input_dim:50
input_dim:8
input_dim:8

layer {
  name: "pool2"
  type: "Python"
  bottom: "relu2_1"
  bottom: "relu2_2"
  top: "pool2_2"
  python_param {
    module: "layer"
    layer: "MaxBLayer"
  }
}