input:"conv2_1"
input_dim:1
input_dim:50
input_dim:8
input_dim:8

input:"conv2_2"
input_dim:1
input_dim:50
input_dim:8
input_dim:8

layer {
  name: "relu2"
  type: "Python"
  bottom: "conv2_1"
  bottom: "conv2_2"
  top: "relu2_1"
  python_param {
    module: "layer"
    layer: "ReluALayer"
  }
}