input:"conv1_1"
input_dim:1
input_dim:20
input_dim:24
input_dim:24

input:"conv1_2"
input_dim:1
input_dim:20
input_dim:24
input_dim:24

layer {
  name: "relu1"
  type: "Python"
  bottom: "conv1_1"
  bottom: "conv1_2"
  top: "relu1_2"
  python_param {
    module: "layer"
    layer: "ReluBLayer"
  }
}