input:"fc1_1"
input_dim:1
input_dim:500
input_dim: 1
input_dim: 1

input:"fc1_2"
input_dim:1
input_dim:500
input_dim: 1
input_dim: 1

layer {
  name: "relu3"
  type: "Python"
  bottom: "fc1_1"
  bottom: "fc1_2"
  top: "relu3_1"
  python_param {
    module: "layer"
    layer: "ReluCLayer"
  }
}