input:"relu3_1"
input_dim:1
input_dim:500
input_dim:1
input_dim:1
layer {
  name: "score"
  type: "InnerProduct"
  bottom: "relu3_1"
  top: "score_1"
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
  }
}
